Series

In [6]:
import pandas as pd

#Create a Series in pandas 
s = pd.Series([3, -5, 7, 4], index=['a', 'b', 'c', 'd'])

#Accessing one element from dataframe
s['b']

-5

In [27]:
#--------------------------------------------BOOLIAN INDEXING -----------------------------------------------
#Series S where value is not >1
a1 = s[~(s>1)]
print(a1)
print("-----------------------------------------")
# S where value is <-1 or >2 
a2 = s[(s<-1) | (s>2)]
print(a2)
print("-----------------------------------------")
# Set index a of Series s to 6
s['a'] = 6 
s['a']

b   -5
dtype: int64
-----------------------------------------
a    3
b   -5
c    7
d    4
dtype: int64
-----------------------------------------

6

In [ ]:
#Delete or drop any column from serie 
s.drop(['a'])

b   -5
c    7
d    4
dtype: int64

====================================================================================================================================================

Data Frame

In [9]:
#Create two daimentional dataframe using pandas 
data = {   'Country': ['Belgium', 'India', 'Brazil'], 
           'Capital': ['Brussels', 'New Delhi', 'Brasília'],
           'Population': [11190846, 1303171035, 207847528]
       }
    
#Convert dataframe into tabuler format
df = pd.DataFrame(data)

#Get Subset of data element 
df[1:]

  Country    Capital  Population
1   India  New Delhi  1303171035
2  Brazil   Brasília   207847528

In [ ]:
#Select single value by raw and column (ByPosition)
df.iloc[[0], [0]]

   Country
0  Belgium

In [ ]:
#Select single value by row &column labels (ByLable)
df.loc[[0], ['Country']]

   Country
0  Belgium

In [ ]:
#Select single row of subset of rows(By Lable/Position)

a = df.loc[[2]]
b = df.loc[:,'Capital'] 
c = df.loc[1, 'Capital']

print(a)
print("--------------------------------------------")
print(b)
print("--------------------------------------------")
print(c)

  Country   Capital  Population
2  Brazil  Brasília   207847528
--------------------------------------------
0     Brussels
1    New Delhi
2     Brasília
Name: Capital, dtype: object
--------------------------------------------
New Delhi

In [ ]:
#--------------------------------------------BOOLIAN INDEXING -----------------------------------------------
#Use filter to adjust Dataframe
df[df['Population']>1200000000]

  Country    Capital  Population
1   India  New Delhi  1303171035

In [ ]:
#-------------------------------------Read and write CSV file---------------------------------------------------- 
df.to_csv("mydataframe.csv")
pd.read_csv("mydataframe.csv")
 #With the use of pandas we can read many types of files like csv ,excel ,etc ..

   Unnamed: 0  Country    Capital  Population
0           0  Belgium   Brussels    11190846
1           1    India  New Delhi  1303171035
2           2   Brazil   Brasília   207847528

In [ ]:
#---------------------------------Delete or drop any column from data frame --------------------------------------
df.drop('Country', axis=1)
  #Drop values from columns(axis=1)

     Capital  Population
0   Brussels    11190846
1  New Delhi  1303171035
2   Brasília   207847528

In [ ]:
#------------------------------------------------Sort & Rank ----------------------------------------------------
df.sort_index() 
  #Sort by labels along an axis

   Country    Capital  Population
0  Belgium   Brussels    11190846
1    India  New Delhi  1303171035
2   Brazil   Brasília   207847528

In [ ]:
df.sort_values(by='Country')
  #Sort by the values along an axis

   Country    Capital  Population
0  Belgium   Brussels    11190846
2   Brazil   Brasília   207847528
1    India  New Delhi  1303171035

In [ ]:
# Assign ranks to entries
df.rank()

   Country  Capital  Population
0      1.0      2.0         1.0
1      3.0      3.0         3.0
2      2.0      1.0         2.0

In [ ]:
#*********************************Retrieving Series/DataFrame Information****************************************

In [ ]:
#---------------------------------------Basic Information---------------------------------------------------------
df.shape
  #its return a number of raws and colunms 
df.index
  #give a information about index 
df.columns
  #give a name of colunms in dataframe 
df.info()
  #Give many information of dataframe
df.count()
  #count non-null values in each column of a DataFrame

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Country     3 non-null      object
 1   Capital     3 non-null      object
 2   Population  3 non-null      int64
dtypes: int64(1), object(2)
memory usage: 200.0+ bytes

Country       3
Capital       3
Population    3
dtype: int64

In [29]:
#-----------------------------------------------Summary-----------------------------------------------------
df.sum()
  #its return sum of values in dataframe 
df.cumsum()
  # calculate the cumulative sum of values along a specified axis in a DataFrame or Series
df.max()
  # it's find a maximum value 
df.min()
  #it's find min value of column
df.describe()
  #it's show Summary statistics
# df.min()
#   #it's shows mean value of column
# df.median()

         Population
count  3.000000e+00
mean   5.074031e+08
std    6.961346e+08
min    1.119085e+07
25%    1.095192e+08
50%    2.078475e+08
75%    7.555093e+08
max    1.303171e+09

In [31]:
#******************************************Applying functions*********************************************************
df['Double_of_population'] = df['Population'].apply(lambda x: x * 2)
df
  #The lambda function f = lambda x: x*2 doubles the input value x

   Country    Capital  Population  Double_of_population
0  Belgium   Brussels    11190846              22381692
1    India  New Delhi  1303171035            2606342070
2   Brazil   Brasília   207847528             415695056

In [34]:
# Define a function to double a number
def double(x):
    return x * 2

# Apply the function to each element in a DataFrame column
df['double_of_population'] = df['Population'].apply(double)
df

   Country    Capital  Population  Double_of_population  double_of_population
0  Belgium   Brussels    11190846              22381692              22381692
1    India  New Delhi  1303171035            2606342070            2606342070
2   Brazil   Brasília   207847528             415695056             415695056

In [41]:
# Define a function to apply to each element
def format_data(element):
    return str(element).upper()

# Use map() to apply the function to each element of the DataFrame
df_formatted = df.apply(lambda x: x.map(format_data))
df_formatted

   Country    Capital  Population Double_of_population double_of_population
0  BELGIUM   BRUSSELS    11190846             22381692             22381692
1    INDIA  NEW DELHI  1303171035           2606342070           2606342070
2   BRAZIL   BRASÍLIA   207847528            415695056            415695056